app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "second title update"], ["body", "second commit update successfully"], ["updated_at", "2019-09-09 12:34:33.289667"], ["id", 2]]
---
  def update
    @post = Post.find(params[:id])
    if @post.update(params[:post].permit(:title, :body))